src/Documents/НачислениеЗП/НачислениеЗП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеЗП</name>
  <registerRecords>AccumulationRegister.НачисленияЗП</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНачисления</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыНачислений</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/НачисленияЗП/НачисленияЗП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НачисленияЗП</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидНачисления</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыНачислений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МесяцНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/НачислениеЗП/ObjectModule.bsl
Процедура Провести()
    НаборЗаписей = РегистрыНакопления.НачисленияЗП.СоздатьНаборЗаписей();
    Для Каждого Строка Из Начисления Цикл
        Запись = НаборЗаписей.Добавить();
        Запись.Период = Период;
        Запись.Сотрудник = Строка.Сотрудник;
        Запись.ВидНачисления = Строка.ВидНачисления;
        Запись.Сумма = Строка.Сумма;
    КонецЦикла;
    НаборЗаписей.Записать();
КонецПроцедуры
